Revit 2027 API
Sweep.IsTrajectorySegmentationEnabled Property
The trajectory segmentation option for the sweep.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsTrajectorySegmentationEnabled { get; set; }
Public Property IsTrajectorySegmentationEnabled As Boolean
	Get
	Set
public:
property bool IsTrajectorySegmentationEnabled {
	bool get ();
	void set (bool value);
}
member IsTrajectorySegmentationEnabled : bool with get, set
Property Value
Boolean
Remarks
This property is used to retrieve/set the trajectory segmentation state of the sweep. if return is true, means user can control the MaxSegmentAngle, otherwise is disable.
See Also
Reference
Sweep Class
Autodesk.Revit.DB Namespace